#pragma once
#include "../BlamData.hpp"
#include "../Preferences/Preferences.hpp"

namespace Blam::Memory
{
	struct main_gamestate_timing
	{
		long flags;
		unsigned long dword4;
		unsigned long dword8;
		unsigned long dwordC;
		unsigned long dword10;
	};
	static_assert(sizeof(main_gamestate_timing) == 0x14);

	struct main_render_timing
	{
		unsigned long dword0;
		unsigned long dword4;
		unsigned long dword8;
		unsigned long dwordC;
		unsigned long dword10;
	};
	static_assert(sizeof(main_render_timing) == 0x14);

	struct main_time_globals
	{
		unsigned long dword0;
		unsigned long dword4;
		unsigned long dword8;
		unsigned long dwordC;
		unsigned long dword10;
		unsigned long dword14;
		unsigned long dword18;
		unsigned long dword1C;
		unsigned long dword20;
		unsigned long dword24;
		unsigned long dword28;
		unsigned long dword2C;
		unsigned long dword30;
		unsigned long dword34;
		unsigned long dword38;
		unsigned long dword3C;
	};
	static_assert(sizeof(main_time_globals) == 0x40);

	struct player_mapping
	{
		unsigned short word0;
		unsigned short word2;
		unsigned long dword4;
		unsigned long dword8;
		unsigned long dwordC;
		unsigned long dword10;
		unsigned long dword14;
		unsigned long dword18;
		unsigned long dword1C;
		unsigned long dword20;
		unsigned long dword24;
		unsigned long dword28;
		unsigned long dword2C;
		unsigned long dword30;
		unsigned char dword34[64];
		unsigned char dword74[64];
		unsigned short wordB4;
		unsigned long dwordB8;
		unsigned long dwordBC;
		unsigned long dwordC0;
		unsigned long dwordC4;
		unsigned long dwordC8;
		unsigned long dwordCC;
		unsigned long dwordD0;
		unsigned long dwordD4;
		unsigned long long qwordD8;
		unsigned long long qwordE0;
	};
	static_assert(sizeof(player_mapping) == 0xE8);

	struct physics_constants
	{
		unsigned long dword0;
		unsigned long dword4;
		unsigned long dword8;
		unsigned long dwordC;
		unsigned long dword10;
		float float14;
		unsigned long dword18;
		unsigned long dword1C;
	};
	static_assert(sizeof(physics_constants) == 0x20);

	struct impact_globals
	{
		unsigned char gap0[132];
		unsigned char byte84;
	};
	static_assert(sizeof(impact_globals) == 0x85);

	struct hue_saturation_control
	{
		unsigned long dword0;
		unsigned long dword4;
		unsigned long dword8;
		unsigned long dwordC;
		unsigned long dword10;
	};
	static_assert(sizeof(hue_saturation_control) == 0x14);

	struct rasterizer_game_states
	{
		unsigned char byte0;
		unsigned char byte1;
		unsigned char byte2;
		unsigned char byte3;
		unsigned char byte4;
	};
	static_assert(sizeof(rasterizer_game_states) == 0x5);

	struct s_decal_datum : Blam::DatumBase
	{
		short : 16;
		long tag_index;
		long unknown8;
		long unknownC;
		long unknown10;
		long unknown14;
		long unknown18;
		long unknown1C;
		long unknown20;
		long unknown24;
		long unknown28;
		long unknown2C;
		long unknown30;
		long unknown34;
		long unknown38;
		long unknown3C;
		long unknown40;
		long unknown44;
		long unknown48;
		long unknown4C;
	};
	static_assert(sizeof(s_decal_datum) == 0x50);

	struct s_particle_system_datum : Blam::DatumBase
	{
		short particle_tag_index;
		long unknown4;
		long unknown8;
		long unknownC;
		long unknown10;
		long unknown14;
		long unknown18;
		long unknown1C;
		long unknown20;
		long unknown24;
		long unknown28;
		long unknown2C;
		long unknown30;
		long unknown34;
		long unknown38;
		long unknown3C;
		long unknown40;
		long unknown44;
		long unknown48;
		long unknown4C;
		long unknown50;
		long unknown54;
	};
	static_assert(sizeof(s_particle_system_datum) == 0x58);

	struct tls_data
	{
		char *unknown0;
		char *unknown4;
		char *simulation_gamestate_entities;
		main_gamestate_timing *main_gamestate_timing;
		main_render_timing *main_render_timing;
		main_time_globals *main_time_globals;
		Blam::Preferences *preferences;
		char *unknown1C;
		char *unknown20;
		char *unknown24;
		char *unknown28;
		char *unknown2C;
		char *unknown30;
		char *deterministic_random_seed;
		char *filo_related;
		char *game_globals;
		char *players_header;
		char *players_globals;
		char *game_engine_globals;
		char *local_game_engine_globals;
		char *game_time;
		char *breakable_surface;
		char *breakable_surface_set_broken_event;
		player_mapping *player_mapping;
		char *director_globals;
		char *director_camera_scripted;
		char *deterministic_hs_thread;
		char *hs_runtime;
		char *hs;
		char *hs_distributed;
		char *tracking_hs_thread;
		char *nondeterministic_hs_thread;
		char *unknown80;
		char *unknown84;
		char *unknown88;
		char *unknown8C;
		char *unknown90;
		char *unknown94;
		char *unknown98;
		char *unknown9C;
		char *effect;
		char *effect_event;
		char *effect_location;
		char *effect_counts;
		char *effect_geometry_sample;
		char *effect_messaging_queue;
		char *effect_lightprobes;
		char *havok_gamestate;
		char *unknownC0;
		char *player_control;
		char *player_control_deterministic;
		char *object_looping_sounds;
		char *game_sound_globals;
		char *game_sound_scripted_impulses;
		char *s_structure_seam;
		char *visibility_active_portals;
		char *campaign_meta_game;
		char *observer_gamestate;
		char *observer;
		char *rumble;
		char *bink_gamestate;
		char *unknownF4;
		char *c_font_cache_mt_safe;
		char *sound_classes;
		char *game_allegiance;
		char *atmosphere_fog;
		char *soft_surface;
		char *game_sound_player_effects;
		char *havok_proxies;
		char *unknown114;
		char *unknown118;
		char *unknown11C;
		char *unknown120;
		char *unknown124;
		char *unknown128;
		char *unknown12C;
		char *unknown130;
		char *unknown134;
		char *unknown138;
		char *unknown13C;
		char *unknown140;
		char *unknown144;
		char *unknown148;
		char *unknown14C;
		char *unknown150;
		char *unknown154;
		char *unknown158;
		char *unknown15C;
		char *unknown160;
		char *unknown164;
		char *unknown168;
		char *unknown16C;
		char *unknown170;
		char *unknown174;
		char *unknown178;
		char *unknown17C;
		char *unknown180;
		char *unknown184;
		char *unknown188;
		char *unknown18C;
		char *unknown190;
		char *unknown194;
		char *unknown198;
		char *unknown19C;
		char *unknown1A0;
		char *unknown1A4;
		char *unknown1A8;
		char *unknown1AC;
		char *unknown1B0;
		char *unknown1B4;
		char *unknown1B8;
		char *unknown1BC;
		char *unknown1C0;
		char *unknown1C4;
		char *unknown1C8;
		char *unknown1CC;
		char *unknown1D0;
		char *unknown1D4;
		char *unknown1D8;
		char *unknown1Dc;
		char *unknown1E0;
		char *unknown1E4;
		char *unknown1E8;
		char *unknown1EC;
		char *unknown1F0;
		char *unknown1F4;
		char *unknown1F8;
		char *unknown1FC;
		char *unknown200;
		char *unknown204;
		char *unknown208;
		char *unknown20C;
		char *unknown210;
		char *unknown214;
		char *unknown218;
		char *unknown21C;
		char *unknown220;
		char *unknown224;
		char *unknown228;
		char *unknown22C;
		char *unknown230;
		char *unknown234;
		char *unknown238;
		char *unknown23C;
		char *unknown240;
		char *unknown244;
		char *unknown248;
		char *unknown24C;
		char *unknown250;
		char *unknown254;
		char *unknown258;
		char *unknown25C;
		char *unknown260;
		char *unknown264;
		char *unknown268;
		char *unknown26C;
		char *unknown270;
		char *unknown274;
		char *unknown278;
		char *unknown27C;
		char *unknown280;
		char *unknown284;
		char *unknown288;
		char *unknown28C;
		char *unknown290;
		char *unknown294;
		char *unknown298;
		char *unknown29C;
		char *unknown2A0;
		char *unknown2A4;
		char *unknown2A8;
		char *unknown2AC;
		char *unknown2B0;
		char *unknown2B4;
		char *unknown2B8;
		char *unknown2BC;
		char *unknown2C0;
		char *unknown2C4;
		char *unknown2C8;
		char *unknown2CC;
		char *unknown2D0;
		char *unknown2D4;
		char *unknown2D8;
		char *unknown2DC;
		char *unknown2E0;
		char *unknown2E4;
		char *unknown2E8;
		char *unknown2EC;
		char *unknown2F0;
		char *unknown2F4;
		char *unknown2F8;
		char *unknown2FC;
		char *unknown300;
		char *unknown304;
		char *unknown308;
		char *unknown30C;
		char *unknown310;
		char *unknown314;
		char *unknown318;
		char *unknown31C;
		char *cinematic_new;
		char *cinematic;
		char *cinematic_light;
		physics_constants *physics_constants;
		char *recorded_animations;
		char *game_save;
		char *screen_effect;
		char *player_effects;
		char *scenario_interpolator;
		char *survival_mode;
		char *player_training;
		char *kill_trigger_volume_state;
		char *deterministic_game_sound;
		Blam::DataArray<s_decal_datum> *decal_system;
		char *decal_counts;
		char *decal;
		char *decal_messaging_queue;
		impact_globals *impact;
		char *impacts;
		char *impact_arrays;
		char *object_list_header;
		char *object_list_data;
		char *camera_script_globals;
		Blam::DataArrayBase *particles;
		Blam::DataArray<s_particle_system_datum> *particle_system;
		char *contrail_system;
		char *contrail;
		char *contrail_location;
		char *contrail_profile;
		char *particle_location_data;
		char *light_volume_system;
		char *light_volume_location;
		char *light_volume;
		char *beam_system;
		char *beam;
		char *beam_location;
		hue_saturation_control *hue_saturation_control;
		char *ragdolls;
		char *particle_emitter;
		rasterizer_game_states *rasterizer_game_states;
		char *unknown3C0_render_postprocess_color_tweaking;
		char *unknown3C4;
		char *scripted_exposure_game_globals;
		char *hud_camera_globals;
		char *water_interaction_event;
		char *render_texture_camera_globals_allocator;
		char *render_game_globals;
		char *depth_of_field_game_globals;
		char *cached_object_render_states;
		char *particle_emitter_gpu_row;
		char *particle_emitter_gpu_1;
		char *particle_emitter_gpu_2;
		char *beam_gpu;
		char *beam_gpu_row;
		char *particle_emitter_gpu_3;
		char *contrail_gpu_row;
		char *contrail_gpu;
		char *particle_emitter_gpu_4;
		char *light_volume_gpu;
		char *light_volume_gpu_row;
		char *particle_emitter_gpu_5;
		char *rasterizer_implicit_geometry_data;
		char *render_object;
		char *shield_render_cache_message;
		char *chud_persistent_user_data;
		char *chud_persistent_global_data;
		char *user_widget_0;
		char *user_widget_1;
		char *user_widget_2;
		char *user_widget_3;
		char *first_person_weapon_orientations;
		char *first_person_weapons;
		char *cortana_globals;
		char *campaign_objectives;
		char *object_header;
		char *object;
		char *objects;
		char *object_name_list;
		char *object_messaging_queue;
		char *collideable_object;
		char *damage_globals;
		char *unknown464;
		char *noncollideable_object;
		char *unknown46C;
		char *unknown470;
		char *object_render_data;
		char *damage;
		char *object_placement;
		char *device_groups;
		char *object_scripting;
		char *object_broadphase;
		char *object_early_movers;
		char *object_schedule;
		char *object_activation_regions;
		char *lights;
		char *lights_game_globals;
		char *light_data_reference;
		char *light_cluster_reference;
		char *light_first_data;
		char *nondeterministic_render_light_data;
		char *widget;
		char *recycling_volumes;
		char *recycling_group;
		char *muffin;
		char *leaf_system;
		char *antenna;
		char *cloth;
		char *unknown4CC;
		char *unknown4D0;
		char *unknown4D4;
		char *unknown4D8;
		char *unknown4DC;
		char *unknown4E0;
		char *unknown4E4;
		char *unknown4E8;
		char *unknown4EC;
		char *unknown4F0;
		char *unknown4F4;
		char *unknown4F8;
		char *unknown4FC;
		char *unknown500;
		char *unknown504;
		char *unknown508;
		char *unknown50C;
		char *unknown510;
		char *unknown514;
		char *unknown518;
		char *actor;
		char *actor_firing_position;
		char *ai_reference_frame;
		char *ai;
		char *ai_player_state;
		char *vocalization_records;
		char *vocalization_timers;
		char *command_scripts;
		char *objectives;
		char *task_records;
		char *squad;
		char *squad_group;
		char *swarm;
		char *swarm_spawner;
		char *spawner;
		char *dynamic_firing_points;
		char *propref;
		char *prop;
		char *tracking;
		char *joint_state;
		char *clump;
		char *squad_patrol;
		char *flocks;
		char *formations;
		char *vision_mode;
		char *unknown580;
	};
}